app/controllers/attendances_controller.rb

  def create
    #calls next_ritual from Ritual model (if no next event exists, creates it)
    @ritual = Ritual.next_ritual

    #makes new Attendance object, sets user to current user

    ## removed :user => current_user from params for new, might let me take bool?
    @attendance = Attendance.new(attendance_params)
    #sets ritual to next_ritual
    @attendance.ritual = @ritual
    @attendance.user = current_user



    if @attendance.save
---
INSERT INTO "attendances" ("is_coming", "ritual_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["is_coming", "t"], ["ritual_id", 2], ["user_id", 1], ["created_at", "2016-02-03 01:01:18.448394"], ["updated_at", "2016-02-03 01:01:18.448394"]]