app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		@post.user = current_user


		if @post.save
---
INSERT INTO "posts" ("content", "ritual_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "it was good"], ["ritual_id", 2], ["user_id", 1], ["created_at", "2016-02-03 01:02:01.003800"], ["updated_at", "2016-02-03 01:02:01.003800"]]