app/controllers/rituals_controller.rb

INSERT INTO "rituals" ("date_of", "created_at", "updated_at") VALUES (?, ?, ?)  [["date_of", "2016-02-01 00:49:00.000000"], ["created_at", "2016-02-03 00:49:52.046077"], ["updated_at", "2016-02-03 00:49:52.046077"]]
---
	def create
		@ritual = Ritual.new(ritual_params)

		if @ritual.save

SELECT DISTINCT "rituals".* FROM "rituals" INNER JOIN "attendances" ON "attendances"."ritual_id" = "rituals"."id"
SELECT "users".* FROM "users"
---
	def index
		@ritual = Ritual.joins(:attendances).uniq
		@attendance = Attendance.all
		@user = User.all

SELECT  "rituals".* FROM "rituals" WHERE "rituals"."id" = ? LIMIT 1  [["id", 2]]
SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts" WHERE "posts"."ritual_id" = 25
---
	def show
		@ritual = Ritual.find(params[:id])
		@new_whiskey = Whiskey.new
		@whiskey = Whiskey.all
		@attendance = Attendance.all
		@user = User.all
		@post_new = Post.new
		@post_new.ritual = @ritual
		@ritual_posts = Post.where(:ritual => @ritual)